### Welcome to the final coding challenge!

This challenge requires you to __apply__ and __combine__ many concepts and methods that you have learned in this course.

It is frequently used in job application processes / assessment centers in Data Science to check the candidates´ abilities to work with, manipulate and aggregate data. Also experienced Data Scientists have difficulties to solve the problem. And the reason for this is not that the challenge is coding-wise extremely complex. But it requires a combination of <br>
- __solid coding skills__, <br><br>
and, even more important <br><br>
   
- the ability to __interpret__ and __understand__ the __underlying data__ and to __incorporate inputs__ from subject matter __experts__ (in this case Sports experts) <br> <br>
__"Thinking in Data Structures!"__ -> requires some practise but also some talent.

### The Case

It´s your first day in a Data Science advisory firm and your boss asks you to produce the __official Summer Olympic Games Medal Tables for all Editions from 1896 to 2012__. <br><br>
All you can use is a dataset with raw data containing over 31,000 medals (__summer.csv__) and the official Medal Tables for the Editions 1996 and 1976 from Wikipedia. (__wik_1996.csv__, __wik_1976.csv__). Use the two official Medal Tables as a __reference__ to check whether your code produces the correct output! <br><br>
Your goal is to __minimize the divergence__ between your aggregated Medal Tables and the official Medal Tables. Let´s assume that the official number of Gold Medals for the United States in the Edition 1996 is 44 and your code produces 46. This is an absolute divergence of 2. <br> <br>
__Calculate the total absolute divergence for the Editions 1996 and 1976 (the "Score")!__ The __optimal Score is 0__!

In [1]:
import numpy as np
import pandas as pd

In [2]:
wik_1996 = pd.read_csv('wik_1996.csv')
wik_1976 = pd.read_csv('wik_1976.csv')
summer = pd.read_csv('summer.csv')

In [3]:
wik_1996.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    80 non-null     object
 1   Nation  80 non-null     object
 2   Gold    80 non-null     int64
 3   Silver  80 non-null     int64
 4   Bronze  80 non-null     int64
 5   Total   80 non-null     int64
dtypes: int64(4), object(2)
memory usage: 3.9+ KB

In [4]:
wik_1976.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    42 non-null     object
 1   NOC     42 non-null     object
 2   Gold    42 non-null     int64
 3   Silver  42 non-null     int64
 4   Bronze  42 non-null     int64
 5   Total   42 non-null     int64
dtypes: int64(4), object(2)
memory usage: 2.1+ KB

In [5]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

#### Summer

In [6]:
summer.dropna(inplace=True)

In [8]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

#### wik_1976

In [9]:
wik_1976

                Rank                        NOC  Gold  Silver  Bronze  Total
0                  1         Soviet Union (URS)    49      41      35    125
1                  2         East Germany (GDR)    40      25      25     90
2                  3        United States (USA)    34      35      25     94
3                  4         West Germany (FRG)    10      12      17     39
4                  5                Japan (JPN)     9       6      10     25
5                  6               Poland (POL)     7       6      13     26
6                  7             Bulgaria (BUL)     6       9       7     22
7                  8                 Cuba (CUB)     6       4       3     13
8                  9              Romania (ROU)     4       9      14     27
9                 10              Hungary (HUN)     4       5      13     22
10                11              Finland (FIN)     4       2       0      6
11                12               Sweden (SWE)     4       1       0      5
12                13        Great Britain (GBR)     3       5       5     13
13                14                Italy (ITA)     2       7       4     13
14                15               France (FRA)     2       3       4      9
15                16           Yugoslavia (YUG)     2       3       3      8
16                17       Czechoslovakia (TCH)     2       2       4      8
17                18          New Zealand (NZL)     2       1       1      4
18                19          South Korea (KOR)     1       1       4      6
19                20          Switzerland (SUI)     1       1       2      4
20                21              Jamaica (JAM)     1       1       0      2
21                21          North Korea (PRK)     1       1       0      2
22                21               Norway (NOR)     1       1       0      2
23                24              Denmark (DEN)     1       0       2      3
24                25               Mexico (MEX)     1       0       1      2
25                26  Trinidad and Tobago (TRI)     1       0       0      1
26                27              Canada (CAN)*     0       5       6     11
27                28              Belgium (BEL)     0       3       3      6
28                29          Netherlands (NED)     0       2       3      5
29                30             Portugal (POR)     0       2       0      2
30                30                Spain (ESP)     0       2       0      2
31                32            Australia (AUS)     0       1       4      5
32                33                 Iran (IRI)     0       1       1      2
33                34             Mongolia (MGL)     0       1       0      1
34                34            Venezuela (VEN)     0       1       0      1
35                36               Brazil (BRA)     0       0       2      2
36                37              Austria (AUT)     0       0       1      1
37                37              Bermuda (BER)     0       0       1      1
38                37             Pakistan (PAK)     0       0       1      1
39                37          Puerto Rico (PUR)     0       0       1      1
40                37             Thailand (THA)     0       0       1      1
41  Totals (41 NOCs)           Totals (41 NOCs)   198     199     216    613

In [21]:
wik_1976['Country'] = wik_1976['NOC'].str.split('(', expand=True).loc[:,1].str.replace(')', '').str.replace('*', '')

<ipython-input-21-e563229d7abf>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wik_1976['Country'] = wik_1976['NOC'].str.split('(', expand=True).loc[:,1].str.replace(')', '').str.replace('*', '')

wik_1976.drop(columns=['NOC', 'Rank', 'Total'], inplace=True)

#### wik_1996

In [31]:
wik_1996['Country'] = wik_1996['Nation'].str.split('(', expand=True).loc[:,1].str.replace(')','').str.replace('*','')

<ipython-input-31-4b7d90fc7aec>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  wik_1996['Country'] = wik_1996['Nation'].str.split('(', expand=True).loc[:,1].str.replace(')','').str.replace('*','')

In [32]:
wik_1996

,Rank,Nation,Gold,Silver,Bronze,Total,Country
0,1,United States (USA)*,44,32,25,101,USA
1,2,Russia (RUS),26,21,16,63,RUS
2,3,Germany (GER),20,18,27,65,GER
3,4,China (CHN),16,22,12,50,CHN
4,5,France (FRA),15,7,15,37,FRA
...,...,...,...,...,...,...,...
75,71,Mozambique (MOZ),0,0,1,1,MOZ
76,71,Puerto Rico (PUR),0,0,1,1,PUR
77,71,Tunisia (TUN),0,0,1,1,TUN
78,71,Uganda (UGA),0,0,1,1,UGA
79,Totals (79 nations),Totals (79 nations),271,273,298,842,79 nations

In [34]:
wik_1996.drop(columns=['Rank','Nation', 'Total'], inplace=True)

###

In [37]:
summer76 = summer.loc[summer['Year'] == 1976]
summer76

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
13900,1976,Montreal,Aquatics,Diving,"ALEINIK, Vladimir",URS,Men,10M Platform,Bronze
13901,1976,Montreal,Aquatics,Diving,"DIBIASI, Klaus",ITA,Men,10M Platform,Gold
13902,1976,Montreal,Aquatics,Diving,"LOUGANIS, Gregory",USA,Men,10M Platform,Silver
13903,1976,Montreal,Aquatics,Diving,"WILSON, Deborah Keplar",USA,Women,10M Platform,Bronze
13904,1976,Montreal,Aquatics,Diving,"VAYTSEKHOVSKAYA, Elena",URS,Women,10M Platform,Gold
...,...,...,...,...,...,...,...,...,...
15200,1976,Montreal,Wrestling,Wrestling Gre-R,"REZANTSEV, Valeri",URS,Men,82 - 90KG (Light-Heavyweight),Gold
15201,1976,Montreal,Wrestling,Wrestling Gre-R,"IVANOV, Stoyan",BUL,Men,82 - 90KG (Light-Heavyweight),Silver
15202,1976,Montreal,Wrestling,Wrestling Gre-R,"SKRZYDLEWSKI, Andrzej",POL,Men,90 - 100KG (Heavyweight),Bronze
15203,1976,Montreal,Wrestling,Wrestling Gre-R,"BALBOSHIN, Nikolai",URS,Men,90 - 100KG (Heavyweight),Gold
15204,1976,Montreal,Wrestling,Wrestling Gre-R,"GORANOV, Kamen",BUL,Men,90 - 100KG (Heavyweight),Silver

In [40]:
wik_1976.head(2)

   Gold  Silver  Bronze Country
0    49      41      35     URS
1    40      25      25     GDR

In [45]:
summer76 = summer76.groupby(['Country', 'Medal']).Medal.count().unstack(fill_value=0)

In [54]:
summer76=summer76.sort_values(['Gold', 'Silver', 'Bronze'],ascending=False)[['Gold','Silver','Bronze']]
summer76.head()

Medal    Gold  Silver  Bronze
Country
URS       113      93      79
GDR        99      51      42
USA        63      56      36
JPN        25       6      10
FRG        21      24      30

In [57]:
wik_1976.head()

   Gold  Silver  Bronze Country
0    49      41      35     URS
1    40      25      25     GDR
2    34      35      25     USA
3    10      12      17     FRG
4     9       6      10     JPN

###

-> __Far away from the target!!!__

#### Fortunately, you could manage to get some useful information from Sports experts: <br>

Medals awarded in __Team Events__ (one medal for each member of the team) only count as __one Medal__. For example, the Basketball Team of the United States won the Gold Medal in the Edition 2012. In total __12 Basketball Athletes__ from the United States were awarded with a Gold Medal. For the official Medal Table 2012, this only counts as __one Gold Medal__ for the United States!<br> <br>
All Events with __5 or less than 5 medals__ shall be deemed __Singles Events__. All Events with __more than 5 medals__ shall be deemed __Team Events__. It frequently happens that 2 or 3 Athletes share the Bronze medal. Therefore, in total 4 or 5 medals are awarded in these Singles Events. All of these medals count for the official Medal Table! It also happens in Team Events that two Teams share the Bronze medal. Also in this case, in total 4 medals count for the official Medal Table (1 Gold, 1 Silver, 2 Bronze).
<br><br>
To identify all unique Events, the __Event Gender matters__! There are __Men__ Events, __Women__ Events and __Mixed__ Events. Assume that the following medals have been awarded in __Mixed Events__:
- the Event is marked with "__mixed__" or "__pairs__"
- all "__Equestrian__" Events
- all "__Sailing__" Events __before 1988__ (until and including 1984)
- the following medals (index labels) were awarded in __Badminton mixed Double Events__: [21773, 21782, 21776, 21785, 21770, 21779, 23703, 23712, 23706, 23715, 23709, 23700, 25720, 25729, 25723, 25732, 25726, 25717, 27727, 27736, 27730, 27739, 27724, 27733, 29784, 29785, 29786, 29787, 29788, 29789]

## Now it´s your turn to get the official Medal Tables 1896-2012!

### step 2

In [203]:
summ = summer.copy()

In [204]:
summ.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [205]:
summ['Event_Gender'] = summ['Gender']

In [206]:
summ.loc[summ['Event'].str.lower().str.contains('mixed')].Event_Gender.count()

38

In [207]:
summ.loc[summ['Event'].str.lower().str.contains('pairs')].Event_Gender.count()

12

In [208]:
summ.loc[summ['Sport'].str.lower().str.contains('equestrian')].Event_Gender.count()

939

In [209]:
summ.loc[(summ['Sport'].str.lower().str.contains('sailing')) & (summ.Year<1988)].Event_Gender.count()

755

In [210]:
mask1 = summ['Event'].str.lower().str.contains('mixed')
mask2 = summ['Event'].str.lower().str.contains('pairs')
mask3 = summ['Sport'].str.lower().str.contains('equestrian')
mask4 = ((summ['Sport'].str.lower().str.contains('sailing')) & (summ.Year<1988))

In [211]:
summ.loc[mask1 | mask2 | mask3 | mask4, 'Event_Gender'] = 'X'

In [212]:
badm_mixed = badm_mixed = [21773, 21782, 21776, 21785, 21770, 21779, 23703, 23712, 23706, 23715, 23709, 23700,
                           25720, 25729, 25723, 25732, 25726, 25717,27727, 27736, 27730, 27739, 27724, 27733,
                           29784, 29785, 29786, 29787, 29788, 29789]

In [213]:
summ.loc[badm_mixed, 'Event_Gender'] = 'X'

In [214]:
summ['Event_Gender'].value_counts()

Men      21212
Women     8175
X         1774
Name: Event_Gender, dtype: int64

#### step 3

In [215]:
summ.head(1)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_Gender
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Men

In [238]:
summ['Event_Medals'] = summ.groupby(['Year','Sport','Discipline','Event','Event_Gender']).Medal.transform('count')

In [239]:
summ['Event_Medals'].value_counts().sort_index()
# we have 5 awards that recieved only one medal
# 54 awards that recieved only 2 medals

1         5
2        54
3      9228
4      1684
5        50
       ...
73       73
74       74
76       76
82       82
116     116
Name: Event_Medals, Length: 66, dtype: int64

#### step 4

In [244]:
summ['Team'] = pd.Series(np.where(summ.Event_Medals > 5, 'Yes', 'No'))

In [245]:
summ.Team.value_counts()

Yes    20140
No     11017
Name: Team, dtype: int64

#### step 5

In [255]:
singles =  summ.loc[summ.Team == 'No'].copy()
singles.shape

(11017, 12)

In [256]:
team = summ.loc[summ.Team == 'Yes'].copy()
team.shape

(20140, 12)

In [257]:
team.drop_duplicates(subset=['Year', 'Sport', 'Discipline', 'Country', 'Event', 'Event_Gender', 'Medal'],
                    inplace=True)
team

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_Gender,Event_Medals,Team
84,1896,Athens,Gymnastics,Artistic G.,"BÖCKER, Konrad",GER,Men,"Team, Horizontal Bar",Gold,Men,11,Yes
95,1896,Athens,Gymnastics,Artistic G.,"CHRYSAPHIS, Ioannis",GRE,Men,"Team, Parallel Bars",Bronze,Men,19,Yes
99,1896,Athens,Gymnastics,Artistic G.,"BÖCKER, Konrad",GER,Men,"Team, Parallel Bars",Gold,Men,19,Yes
110,1896,Athens,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,"Team, Parallel Bars",Silver,Men,19,Yes
132,1896,Athens,Tennis,Tennis,"FLACK, Edwin",ZZX,Men,Doubles,Bronze,Men,6,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...
30988,2012,London,Volleyball,Volleyball,"ALVES, Thiago Soares",BRA,Men,Volleyball,Silver,Men,36,Yes
31000,2012,London,Volleyball,Volleyball,"BARI, Andrea",ITA,Men,Volleyball,Bronze,Men,36,Yes
31012,2012,London,Volleyball,Volleyball,"CAIXETA, Tandara",BRA,Women,Volleyball,Gold,Women,36,Yes
31024,2012,London,Volleyball,Volleyball,"AKINRADEWO, Foluke",USA,Women,Volleyball,Silver,Women,36,Yes
31036,2012,London,Volleyball,Volleyball,"ARAKI, Erika",JPN,Women,Volleyball,Bronze,Women,36,Yes

In [259]:
summ_new = pd.concat([singles, team])

In [261]:
summ_new

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Event_Gender,Event_Medals,Team
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Men,2,No
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Men,2,No
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Men,3,No
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Men,3,No
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Men,3,No
...,...,...,...,...,...,...,...,...,...,...,...,...
30988,2012,London,Volleyball,Volleyball,"ALVES, Thiago Soares",BRA,Men,Volleyball,Silver,Men,36,Yes
31000,2012,London,Volleyball,Volleyball,"BARI, Andrea",ITA,Men,Volleyball,Bronze,Men,36,Yes
31012,2012,London,Volleyball,Volleyball,"CAIXETA, Tandara",BRA,Women,Volleyball,Gold,Women,36,Yes
31024,2012,London,Volleyball,Volleyball,"AKINRADEWO, Foluke",USA,Women,Volleyball,Silver,Women,36,Yes
31036,2012,London,Volleyball,Volleyball,"ARAKI, Erika",JPN,Women,Volleyball,Bronze,Women,36,Yes

In [262]:
summ_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14718 entries, 0 to 31036
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          14718 non-null  int64
 1   City          14718 non-null  object
 2   Sport         14718 non-null  object
 3   Discipline    14718 non-null  object
 4   Athlete       14718 non-null  object
 5   Country       14718 non-null  object
 6   Gender        14718 non-null  object
 7   Event         14718 non-null  object
 8   Medal         14718 non-null  object
 9   Event_Gender  14718 non-null  object
 10  Event_Medals  14718 non-null  int64
 11  Team          14718 non-null  object
dtypes: int64(2), object(10)
memory usage: 1.5+ MB

#### step 6

In [264]:
medal_table = summ_new.groupby(['Year', 'Country', 'Medal']).Medal.count().unstack(fill_value=0)[['Gold','Silver','Bronze']]

In [265]:
medal_table

Medal         Gold  Silver  Bronze
Year Country
1896 AUS         2       0       0
     AUT         2       1       2
     DEN         1       2       3
     FRA         5       4       2
     GBR         2       3       2
...            ...     ...     ...
2012 UGA         1       0       0
     UKR         6       4       9
     USA        46      28      32
     UZB         1       0       2
     VEN         1       0       0

[1157 rows x 3 columns]

#### step 7

In [266]:
wik_1996.set_index('Country', inplace=True)
wik_1976.set_index('Country', inplace=True)

In [267]:
agg_1996 = medal_table.loc[1996].sort_values(['Gold','Silver','Bronze'], ascending=False).copy()

In [269]:
agg_1976 = medal_table.loc[1976].sort_values(['Gold','Silver','Bronze'], ascending=False).copy()

In [271]:
wik_1976.sub(agg_1976).sum().sum()

0.0

In [272]:
wik_1996.sub(agg_1996).sum().sum()

0.0